; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v2 ?v8)
             (pred_3 ?v4 ?v13)
             (pred_1 ?v2 ?v13)
             (pred_2 ?v9 ?v2 )
	     (pred_8 ?v2)
             (pred_5 ?v7)
             (pred_12 ?v4)
             (pred_10 ?v13)
             (pred_6 ?v2)
             (pred_7 ?v4)
             (pred_4 ?v2)
             (pred_11 ))



(:action op_3
:parameters (?v5 ?v1 ?v11 ?v12)
:precondition (and (pred_5 ?v5) (pred_5 ?v1) (pred_12 ?v11) (pred_10 ?v12)
          (pred_9 ?v5 ?v1) (pred_3 ?v11 ?v12)
                   (pred_1 ?v1 ?v12) (pred_8 ?v5) 
                   (pred_6 ?v1) (pred_7 ?v11))
:effect (and  (pred_4 ?v1) (not (pred_6 ?v1))))


(:action op_2
:parameters (?v5 ?v6)
:precondition (and (pred_5 ?v5) (pred_5 ?v6)
               (pred_8 ?v5) (pred_9 ?v5 ?v6) (pred_4 ?v6))
:effect (and (pred_8 ?v6) (not (pred_8 ?v5))))

(:action op_4
:parameters (?v5 ?v11)
:precondition (and (pred_5 ?v5) (pred_12 ?v11) 
                  (pred_8 ?v5) (pred_2 ?v11 ?v5) (pred_11 ))
:effect (and (pred_7 ?v11)
   (not (pred_2 ?v11 ?v5)) (not (pred_11 ))))


(:action op_5
:parameters (?v5 ?v3 ?v10)
:precondition (and (pred_5 ?v5) (pred_12 ?v3) (pred_12 ?v10)
                  (pred_8 ?v5) (pred_7 ?v10) (pred_2 ?v3 ?v5))
:effect (and (pred_7 ?v3) (pred_2 ?v10 ?v5)
        (not (pred_7 ?v10)) (not (pred_2 ?v3 ?v5))))

(:action op_1
:parameters (?v5 ?v11)
:precondition (and (pred_5 ?v5) (pred_12 ?v11) 
                  (pred_8 ?v5) (pred_7 ?v11))
:effect (and (pred_11 ) (pred_2 ?v11 ?v5) (not (pred_7 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_30 obj_15 obj_16 obj_27 obj_13 obj_29 obj_09 obj_18 obj_01 obj_02 obj_24 obj_04 obj_03 obj_14 obj_19 obj_07 obj_20 obj_08 obj_06 obj_26 obj_17 obj_28 obj_05 obj_25
    obj_12 obj_10
    obj_23 obj_21 obj_11
    )

    (:init
       (pred_11)

       (pred_5 obj_22)
       (pred_5 obj_30)
       (pred_5 obj_15)
       (pred_5 obj_16)
       (pred_5 obj_27)
       (pred_5 obj_13)
       (pred_5 obj_29)
       (pred_5 obj_09)
       (pred_5 obj_18)
       (pred_5 obj_01)
       (pred_5 obj_02)
       (pred_5 obj_24)
       (pred_5 obj_04)
       (pred_5 obj_03)
       (pred_5 obj_14)
       (pred_5 obj_19)
       (pred_5 obj_07)
       (pred_5 obj_20)
       (pred_5 obj_08)
       (pred_5 obj_06)
       (pred_5 obj_26)
       (pred_5 obj_17)
       (pred_5 obj_28)
       (pred_5 obj_05)
       (pred_5 obj_25)
       (pred_10 obj_12)
       (pred_10 obj_10)
       (pred_12 obj_23)
       (pred_12 obj_21)
       (pred_12 obj_11)

       (pred_9 obj_22 obj_13)
       (pred_9 obj_22 obj_30)
       (pred_9 obj_30 obj_29)
       (pred_9 obj_30 obj_15)
       (pred_9 obj_30 obj_22)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_15 obj_30)
       (pred_9 obj_16 obj_18)
       (pred_9 obj_16 obj_27)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_27 obj_01)
       (pred_9 obj_27 obj_16)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_13 obj_29)
       (pred_9 obj_13 obj_22)
       (pred_9 obj_29 obj_24)
       (pred_9 obj_29 obj_09)
       (pred_9 obj_29 obj_30)
       (pred_9 obj_29 obj_13)
       (pred_9 obj_09 obj_04)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_09 obj_15)
       (pred_9 obj_09 obj_29)
       (pred_9 obj_18 obj_03)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_18 obj_16)
       (pred_9 obj_18 obj_09)
       (pred_9 obj_01 obj_14)
       (pred_9 obj_01 obj_27)
       (pred_9 obj_01 obj_18)
       (pred_9 obj_02 obj_19)
       (pred_9 obj_02 obj_24)
       (pred_9 obj_02 obj_13)
       (pred_9 obj_24 obj_07)
       (pred_9 obj_24 obj_04)
       (pred_9 obj_24 obj_29)
       (pred_9 obj_24 obj_02)
       (pred_9 obj_04 obj_20)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_04 obj_09)
       (pred_9 obj_04 obj_24)
       (pred_9 obj_03 obj_08)
       (pred_9 obj_03 obj_14)
       (pred_9 obj_03 obj_18)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_14 obj_01)
       (pred_9 obj_14 obj_03)
       (pred_9 obj_19 obj_26)
       (pred_9 obj_19 obj_07)
       (pred_9 obj_19 obj_02)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_07 obj_20)
       (pred_9 obj_07 obj_24)
       (pred_9 obj_07 obj_19)
       (pred_9 obj_20 obj_28)
       (pred_9 obj_20 obj_08)
       (pred_9 obj_20 obj_04)
       (pred_9 obj_20 obj_07)
       (pred_9 obj_08 obj_05)
       (pred_9 obj_08 obj_06)
       (pred_9 obj_08 obj_03)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_06 obj_25)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_06 obj_08)
       (pred_9 obj_26 obj_17)
       (pred_9 obj_26 obj_19)
       (pred_9 obj_17 obj_28)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_26)
       (pred_9 obj_28 obj_05)
       (pred_9 obj_28 obj_20)
       (pred_9 obj_28 obj_17)
       (pred_9 obj_05 obj_25)
       (pred_9 obj_05 obj_08)
       (pred_9 obj_05 obj_28)
       (pred_9 obj_25 obj_06)
       (pred_9 obj_25 obj_05)
       (pred_6 obj_06)
       (pred_6 obj_14)
       (pred_6 obj_05)
       (pred_1  obj_06 obj_12)
       (pred_1  obj_14 obj_10)
       (pred_1  obj_05 obj_10)
       (pred_4 obj_22)
       (pred_4 obj_30)
       (pred_4 obj_15)
       (pred_4 obj_16)
       (pred_4 obj_27)
       (pred_4 obj_13)
       (pred_4 obj_29)
       (pred_4 obj_09)
       (pred_4 obj_18)
       (pred_4 obj_01)
       (pred_4 obj_02)
       (pred_4 obj_24)
       (pred_4 obj_04)
       (pred_4 obj_03)
       (pred_4 obj_19)
       (pred_4 obj_07)
       (pred_4 obj_20)
       (pred_4 obj_08)
       (pred_4 obj_26)
       (pred_4 obj_17)
       (pred_4 obj_28)
       (pred_4 obj_25)

       (pred_3  obj_23 obj_12)
       (pred_3  obj_21 obj_10)
       (pred_3  obj_11 obj_10)
       (pred_2 obj_23 obj_03)
       (pred_2 obj_21 obj_04)
       (pred_2 obj_11 obj_03)
       (pred_8 obj_22)
    )

    (:goal (and
       (pred_2 obj_23 obj_30)
       (pred_2 obj_21 obj_26)
    ))
(:constraints
  (always (not (pred_8 obj_24)))
)
)

; plan
1. (op_2 obj_22 obj_13)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_13)
   goals met: 0 of 2
2. (op_2 obj_13 obj_02)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_02)
   goals met: 0 of 2
3. (op_2 obj_02 obj_19)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_19)
   goals met: 0 of 2
4. (op_2 obj_19 obj_07)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_07)
   goals met: 0 of 2
5. (op_2 obj_07 obj_20)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_20)
   goals met: 0 of 2
6. (op_2 obj_20 obj_04)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_04)
   goals met: 0 of 2
7. (op_2 obj_04 obj_03)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_03)
   goals met: 0 of 2
8. (op_4 obj_03 obj_23)
   deleted: (pred_2 obj_23 obj_03) (pred_11)
   added: (pred_7 obj_23)
   goals met: 0 of 2
9. (op_2 obj_03 obj_04)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_04)
   goals met: 0 of 2
10. (op_5 obj_04 obj_21 obj_23)
   deleted: (pred_7 obj_23) (pred_2 obj_21 obj_04)
   added: (pred_7 obj_21) (pred_2 obj_23 obj_04)
   goals met: 0 of 2
11. (op_2 obj_04 obj_20)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_20)
   goals met: 0 of 2
12. (op_2 obj_20 obj_07)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_07)
   goals met: 0 of 2
13. (op_2 obj_07 obj_17)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_17)
   goals met: 0 of 2
14. (op_2 obj_17 obj_26)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_26)
   goals met: 0 of 2
15. (op_1 obj_26 obj_21)
   deleted: (pred_7 obj_21)
   added: (pred_11) (pred_2 obj_21 obj_26)
   goals met: 1 of 2
16. (op_2 obj_26 obj_17)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_17)
   goals met: 1 of 2
17. (op_2 obj_17 obj_07)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_07)
   goals met: 1 of 2
18. (op_2 obj_07 obj_20)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_20)
   goals met: 1 of 2
19. (op_2 obj_20 obj_04)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_04)
   goals met: 1 of 2
20. (op_4 obj_04 obj_23)
   deleted: (pred_2 obj_23 obj_04) (pred_11)
   added: (pred_7 obj_23)
   goals met: 1 of 2
21. (op_2 obj_04 obj_09)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_09)
   goals met: 1 of 2
22. (op_2 obj_09 obj_15)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_15)
   goals met: 1 of 2
23. (op_2 obj_15 obj_30)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_30)
   goals met: 1 of 2
24. (op_1 obj_30 obj_23)
   deleted: (pred_7 obj_23)
   added: (pred_11) (pred_2 obj_23 obj_30)
   goals met: 2 of 2
